# ■ 파이썬의 장점
# 1. 파이썬의 문법은 쉽다.
# 2. 라이브러리(모듈)이 많아서 유용하다.
#
# - numpy 모듈: 수학 연산에 필요한 모듈
# - beautiful soup 모듈: 웹스크롤링 모듈
# - pandas 모듈: 데이터 검색 모듈
#
# 3장.파이썬 설치
#
# 4장.데이터 다루기
#
# 4.1.파이썬에서의 변수 사용법
#  - 일반 변수: 변수 안에 데이터가 한개
#  - 예: a = 1000
a = 1000
print(a)
print(type(a))  # a 변수의 데이터 유형을 확인하겠다

# < class 'int'> < ---- 숫자 데이터 타입

b = 'aaa'
print(type(b))

# < class(type(b))> < ---- 문자 데이터 타입

# ■ 리스트 변수: 변수안에 여러개의 데이터(요소)가 들어있는 변수
d = [1000, 2000, 3000, 4000]
print(d)
d = [1000, 2000, 3000, 4000]
print(d)
print(type(d))

# 4.2.산술연산자
# 4.3.함수
# 4.4.input 명령어 사용법

print('')
print('====================================================================================================')
print('== 문제 1. 위의 d 리스트 변수에서 1000 을 출력하시오!')
print('====================================================================================================')
d = [1000, 2000, 3000, 4000]

print(d[0])
# ※ 설명 : d list 변수에서 0번째 요소를 출력하시오!
#          파이썬은 시작을 0부터 시작한다.


print('')
print('====================================================================================================')
print('== 문제 2. d 리스트 변수안에 있는 요소들을 하나씩 출력하시오!')
print('====================================================================================================')
d = [1000, 2000, 3000, 4000]

for i in d:
    print(i)

for i in range(100):
    print(i)
# ※ 설명 : 파이썬은 PL/SQL 이나 java, c 언어 처럼 세미콜론을 사용하지 않고 그냥 콜론을 사용하는데 반드시 콜론을 끝에 적어줘야하는
#          문법이 if, while loop, for loop, def 함수 생성 시 사용한다.


print('')
print('====================================================================================================')
print('== 문제 3. a 라는 리스트 변수에 아래의 내용을 담으시오!')
print('====================================================================================================')
a = ['7839', 'KING', 'PRESIDENT', '0', '1981-11-17', '5000', '', '10']
print(a)


print('')
print('====================================================================================================')
print('== 문제 4. a 라는 변수 안에 있는 요소들을 끄집어내서 출력하시오!')
print('====================================================================================================')
for i in a:
    print(i)


print('')
print('====================================================================================================')
print("== 문제 5. '7839' 를 출력하세요.")
print('====================================================================================================')
print(a[0])

# 2. 함수
# ■ len 함수 : 리스트 변수안에 있는 요소들이 몇개인지 출력하는 함수
print(len(a))


print('')
print('====================================================================================================')
print('== 문제 6. 카페에서 파이썬 수업자료에 emp2.csv 를 내려받아 D 드라이브 밑에 DATA 라는 폴더에 다운받고 아래와 같이 수행한다.')
print('====================================================================================================')
import csv

file = open('D:\\KYH\\02.PYTHON\\data\\emp2.csv', 'r')
emp_csv = csv.reader(file)

for emp_list in emp_csv:
    print(emp_list)


print('')
print('====================================================================================================')
print('== 문제 7. 위의 결과에서 사원번호만 출력하시오!')
print('====================================================================================================')
file = open('D:\\KYH\\02.PYTHON\\data\\emp2.csv', 'r')
emp_csv = csv.reader(file)

for emp_list in emp_csv:
    print(emp_list[0])


print('')
print('====================================================================================================')
print('== 문제 8. 이름과 월급을 출력하시오!')
print('====================================================================================================')
file = open('D:\\KYH\\02.PYTHON\\data\\emp2.csv', 'r')
emp_csv = csv.reader(file)

for emp_list in emp_csv:
    print(emp_list[1], emp_list[5])


print('')
print('====================================================================================================')
print('== 문제 9. 위의 14개의 리스트 변수 요소의 개수를 아래와 같이 출력하시오!')
print('====================================================================================================')
file = open('D:\\KYH\\02.PYTHON\\data\\emp2.csv', 'r')
emp_csv = csv.reader(file)

for emp_list in emp_csv:
    print(len(emp_list))


print('')
print('====================================================================================================')
print('== 문제 10. 이름과 이름의 길이를 아래와 같이 출력하시오!')
print('====================================================================================================')
file = open('D:\\KYH\\02.PYTHON\\data\\emp2.csv', 'r')
emp_csv = csv.reader(file)

for emp_list in emp_csv:
    print(emp_list[1], len(emp_list[1]))

# ■ 4.3 산술 연산자
print('')
print('====================================================================================================')
print('== 문제 11. 사원번호, 이름, 월급을 출력하시오!')
print('====================================================================================================')
file = open('D:\\KYH\\02.PYTHON\\data\\emp2.csv', 'r')
emp_csv = csv.reader(file)

for emp_list in emp_csv:
    print(emp_list[0], emp_list[1], emp_list[5])


print('')
print('====================================================================================================')
print('== 문제 12. 이름과 연봉(sal*12) 를 출력하시오!')
print('====================================================================================================')
file = open('D:\\KYH\\02.PYTHON\\data\\emp2.csv', 'r')
emp_csv = csv.reader(file)

for emp_list in emp_csv:
    print(emp_list[1], int(emp_list[5])*12)


print('')
print('====================================================================================================')
print('== 문제 13. 이름과 커미션을 출력하는데 커미션 None 이면 0으로 출력하시오.')
print('====================================================================================================')
file = open('D:\\KYH\\02.PYTHON\\data\\emp_comm.csv', 'r')
emp_csv = csv.reader(file)

for emp_list in emp_csv:
    print(emp_list[1], 0 if emp_list[6] is '' else emp_list[6])