import pandas as pd
from PythonClass.common_func import CommonFunc

print('')
print('====================================================================================================')
print('== 문제 111. 숫자를 물어보게하고 숫자를 입력해서 짝수인지 홀수인지를 출력하는 if 문을 이용한 파이썬 코드를 작성하시오!')
print('====================================================================================================')
a = int(input('숫자를 입력하세요 : '))

print('짝수') if a % 2 == 0 else print('홀수')


print('')
print('====================================================================================================')
print('== 문제 113. 이름을 물어보게하고 이름을 입력하면 해당 사원이 고소득자인지 저소득자인지 출력되게하시오!')
print('====================================================================================================')
ename = input('이름을 입력하세요 : ')
empData = pd.read_csv('D:\\KYH\\02.PYTHON\\data\\emp.csv')
sal = empData[['sal']][empData['ename'] == ename].values[0]

if sal >= 3000:
    print('고소득자 입니다.')
elif sal >= 2000:
    print('적당합니다.')
else:
    print('저소득자입니다.')


print('')
print('====================================================================================================')
print('== 문제 114. 위의 문제를 다시 수행하는 데 이름을 소문자로 입력해도 결과가 출력되게 하시오.')
print('====================================================================================================')
ename = input('이름을 입력하세요 : ')
empData = pd.read_csv('D:\\KYH\\02.PYTHON\\data\\emp.csv')
sal = empData[['sal']][empData['ename'] == ename.upper()].values[0]

if sal >= 3000:
    print('고소득자 입니다.')
elif sal >= 2000:
    print('적당합니다.')
else:
    print('저소득자입니다.')


print('')
print('====================================================================================================')
print('== 문제 115. (알고리즘 문제) 가우스 공식으로 1부터 10까지의 숫자의 합을 출력하시오!')
print('====================================================================================================')
sNum = int(input('첫 번째 수를 입력하세요 : '))
eNum = int(input('마지막 수를 입력하세요 : '))
sum = (eNum+sNum)*((eNum-sNum+1)/2)
print(sum)


print('')
print('====================================================================================================')
print('== 문제 116. 위의 문제를 다시 수행하는데 아래와 같이 큰 숫자를 먼저 입력하면 첫 번째 입력한 숫자가 두 번째 입력한')
print('==  숫자보다 큽니다. 라는 메세지가 출력되게하시오.')
print('====================================================================================================')
sNum = int(input('첫 번째 수를 입력하세요 : '))
eNum = int(input('마지막 수를 입력하세요 : '))
if sNum > eNum:
    print('첫 번째 입력한 숫자가 두 번째 입력한 숫자보다 큽니다.')
else:
    sum = (eNum+sNum)*((eNum-sNum+1)/2)
    print(sum)